app/controllers/sessions_controller.rb

	def create
		auth = request.env["omniauth.auth"]
		session[:omniauth] = auth.except('extra')
		user = User.sign_in_from_omniauth(auth)
		session[:user_id] = user.id
		usuarioSemilogeado = Usuario.find_by(email: auth[:info][:email])
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."email" = $1 LIMIT 1  [["email", "francisco.avello@usach.cl"]]